---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
IFamilyLoadOptions Methods
IFamilyLoadOptions Interface See Also Send Feedback
---

The IFamilyLoadOptions type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
|  | OnFamilyFound | A method called when the family was found in the target document. |
|  | OnSharedFamilyFound | A method called when the shared family was found in the target document. |

# See Also

IFamilyLoadOptions Interface

Autodesk.Revit.DB Namespace